01-decode-latency-anatomy/Results/Round2/03-perf-test/sweep_vllm.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76ef05386840>, trust_remote_code=False, seed=256, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=256, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen2.5-7B-Instruct', input_len=None, output_len=None, tokenizer='Qwen/Qwen2.5-7B-Instruct', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/results', result_filename='len_256.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-ad06e853-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-25 22:00:30 [utils.py:90] Sampling input_len from [256, 256] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 160/160 [00:45<00:00,  3.49it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  45.87     
Total input tokens:                      40960     
Total generated tokens:                  40960     
Request throughput (req/s):              3.49      
Output token throughput (tok/s):         893.03    
Peak output token throughput (tok/s):    976.00    
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          1786.06   
---------------Time to First Token----------------
Mean TTFT (ms):                          269.94    
Median TTFT (ms):                        297.45    
P50 TTFT (ms):                           297.45    
P90 TTFT (ms):                           368.26    
P99 TTFT (ms):                           390.29    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.92     
Median TPOT (ms):                        16.82     
P50 TPOT (ms):                           16.82     
P90 TPOT (ms):                           17.41     
P99 TPOT (ms):                           17.74     
---------------Inter-token Latency----------------
Mean ITL (ms):                           16.92     
Median ITL (ms):                         16.47     
P50 ITL (ms):                            16.47     
P90 ITL (ms):                            17.26     
P99 ITL (ms):                            20.26     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4584.26   
Median E2EL (ms):                        4584.78   
P50 E2EL (ms):                           4584.78   
P90 E2EL (ms):                           4589.38   
P99 E2EL (ms):                           4604.83   
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x78bea9d6e840>, trust_remote_code=False, seed=512, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen2.5-7B-Instruct', input_len=None, output_len=None, tokenizer='Qwen/Qwen2.5-7B-Instruct', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/results', result_filename='len_512.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-5f33c75f-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-25 22:01:32 [utils.py:90] Sampling input_len from [512, 512] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 160/160 [00:50<00:00,  3.19it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  50.11     
Total input tokens:                      81920     
Total generated tokens:                  40960     
Request throughput (req/s):              3.19      
Output token throughput (tok/s):         817.35    
Peak output token throughput (tok/s):    960.00    
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          2452.04   
---------------Time to First Token----------------
Mean TTFT (ms):                          384.02    
Median TTFT (ms):                        434.97    
P50 TTFT (ms):                           434.97    
P90 TTFT (ms):                           538.65    
P99 TTFT (ms):                           753.30    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          18.13     
Median TPOT (ms):                        17.96     
P50 TPOT (ms):                           17.96     
P90 TPOT (ms):                           18.80     
P99 TPOT (ms):                           19.32     
---------------Inter-token Latency----------------
Mean ITL (ms):                           18.13     
Median ITL (ms):                         16.76     
P50 ITL (ms):                            16.76     
P90 ITL (ms):                            17.05     
P99 ITL (ms):                            55.71     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          5007.37   
Median E2EL (ms):                        5013.83   
P50 E2EL (ms):                           5013.83   
P90 E2EL (ms):                           5024.54   
P99 E2EL (ms):                           5195.58   
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71992a1ae840>, trust_remote_code=False, seed=1024, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=256, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen2.5-7B-Instruct', input_len=None, output_len=None, tokenizer='Qwen/Qwen2.5-7B-Instruct', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/results', result_filename='len_1024.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-7c64cf98-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-25 22:02:38 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 160/160 [00:58<00:00,  2.73it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  58.57     
Total input tokens:                      163840    
Total generated tokens:                  40960     
Request throughput (req/s):              2.73      
Output token throughput (tok/s):         699.38    
Peak output token throughput (tok/s):    944.00    
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          3496.90   
---------------Time to First Token----------------
Mean TTFT (ms):                          517.02    
Median TTFT (ms):                        526.95    
P50 TTFT (ms):                           526.95    
P90 TTFT (ms):                           764.02    
P99 TTFT (ms):                           1454.10   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.90     
Median TPOT (ms):                        20.92     
P50 TPOT (ms):                           20.92     
P90 TPOT (ms):                           22.02     
P99 TPOT (ms):                           22.40     
---------------Inter-token Latency----------------
Mean ITL (ms):                           20.90     
Median ITL (ms):                         17.23     
P50 ITL (ms):                            17.23     
P90 ITL (ms):                            18.24     
P99 ITL (ms):                            185.48    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          5846.57   
Median E2EL (ms):                        5848.11   
P50 E2EL (ms):                           5848.11   
P90 E2EL (ms):                           5960.02   
P99 E2EL (ms):                           6649.88   
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x77d346bc6840>, trust_remote_code=False, seed=2048, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=256, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen2.5-7B-Instruct', input_len=None, output_len=None, tokenizer='Qwen/Qwen2.5-7B-Instruct', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/results', result_filename='len_2048.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-7330c3bb-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-25 22:03:53 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 160/160 [01:16<00:00,  2.10it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  76.18     
Total input tokens:                      327680    
Total generated tokens:                  40960     
Request throughput (req/s):              2.10      
Output token throughput (tok/s):         537.68    
Peak output token throughput (tok/s):    880.00    
Peak concurrent requests:                23.00     
Total token throughput (tok/s):          4839.14   
---------------Time to First Token----------------
Mean TTFT (ms):                          832.97    
Median TTFT (ms):                        786.91    
P50 TTFT (ms):                           786.91    
P90 TTFT (ms):                           796.67    
P99 TTFT (ms):                           2966.47   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          26.56     
Median TPOT (ms):                        26.73     
P50 TPOT (ms):                           26.73     
P90 TPOT (ms):                           27.45     
P99 TPOT (ms):                           28.83     
---------------Inter-token Latency----------------
Mean ITL (ms):                           26.56     
Median ITL (ms):                         18.23     
P50 ITL (ms):                            18.23     
P90 ITL (ms):                            19.10     
P99 ITL (ms):                            200.29    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          7604.82   
Median E2EL (ms):                        7604.81   
P50 E2EL (ms):                           7604.81   
P90 E2EL (ms):                           7613.88   
P99 E2EL (ms):                           9757.60   
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x75978fbe6840>, trust_remote_code=False, seed=4096, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=256, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen2.5-7B-Instruct', input_len=None, output_len=None, tokenizer='Qwen/Qwen2.5-7B-Instruct', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/results', result_filename='len_4096.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-718059a5-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-25 22:05:26 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 160/160 [01:53<00:00,  1.40it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  113.99    
Total input tokens:                      655360    
Total generated tokens:                  40960     
Request throughput (req/s):              1.40      
Output token throughput (tok/s):         359.32    
Peak output token throughput (tok/s):    800.00    
Peak concurrent requests:                20.00     
Total token throughput (tok/s):          6108.50   
---------------Time to First Token----------------
Mean TTFT (ms):                          1318.50   
Median TTFT (ms):                        1047.42   
P50 TTFT (ms):                           1047.42   
P90 TTFT (ms):                           1262.72   
P99 TTFT (ms):                           6027.11   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          39.43     
Median TPOT (ms):                        40.46     
P50 TPOT (ms):                           40.46     
P90 TPOT (ms):                           41.03     
P99 TPOT (ms):                           42.67     
---------------Inter-token Latency----------------
Mean ITL (ms):                           39.43     
Median ITL (ms):                         20.26     
P50 ITL (ms):                            20.26     
P90 ITL (ms):                            193.16    
P99 ITL (ms):                            214.19    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11372.42  
Median E2EL (ms):                        11368.25  
P50 E2EL (ms):                           11368.25  
P90 E2EL (ms):                           11385.87  
P99 E2EL (ms):                           16330.00  
==================================================